@echo off
chcp 65001 >nul

echo ================================================================================
echo                    xOS PLAYBOOK - ОТКЛЮЧЕНИЕ
echo                    СОСТОЯНИЯ ВЫБОРОЧНОГО ОТКЛЮЧЕНИЯ
echo ================================================================================
echo.
echo ОПИСАНИЕ:
echo ================================================================================
echo SelectiveSuspendOn - показывает активно ли выборочное отключение для устройства.
echo.
echo ================================================================================
echo ПЛЮСЫ:
echo ================================================================================
echo [+] Устройство не находится в состоянии отключения
echo [+] Нет задержек при использовании
echo.
echo ================================================================================
echo МИНУСЫ:
echo ================================================================================
echo [-] Постоянное энергопотребление
echo.
echo ================================================================================
echo ПРИМЕНЕНИЕ:
echo ================================================================================

for /f "delims=" %%b in ('reg query "HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Enum" /s ^| findstr /i "SelectiveSuspendOn"') do (
    echo %%b | findstr /i "HKEY" >nul
    if not errorlevel 1 (
        Reg.exe add "%%b" /v "SelectiveSuspendOn" /t REG_DWORD /d "0" /f >nul 2>&1
    )
)

echo.
echo ================================================================================
echo                  ГОТОВО! СОСТОЯНИЕ ВЫБОРОЧНОГО ОТКЛЮЧЕНИЯ ОТКЛЮЧЕНО
echo ================================================================================

echo.