@echo off
chcp 65001 >nul

echo ================================================================================
echo                 xOS PLAYBOOK - ВКЛЮЧЕНИЕ ТЕНЕЙ ПОД ЗНАЧКАМИ
echo ================================================================================
echo.
echo ОПИСАНИЕ:
echo ================================================================================
echo Восстанавливает тени под значками.
echo.
echo ================================================================================
echo ПРИМЕНЕНИЕ:
echo ================================================================================

reg delete "HKCU\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced" /v "ListviewShadow" /f

echo.
echo ================================================================================
echo                    ГОТОВО! ТЕНИ ПОД ЗНАЧКАМИ ВКЛЮЧЕНЫ
echo ================================================================================
echo.
echo Для применения изменений перезапустите Проводник или перезагрузитесь.
echo.

echo.