@echo off
chcp 65001 >nul

echo ================================================================================
echo                 xOS PLAYBOOK - ВКЛЮЧЕНИЕ АНИМАЦИИ ПАНЕЛИ ЗАДАЧ
echo ================================================================================
echo.
echo ОПИСАНИЕ:
echo ================================================================================
echo Восстанавливает анимацию панели задач.
echo.
echo ================================================================================
echo ПРИМЕНЕНИЕ:
echo ================================================================================

reg delete "HKCU\SOFTWARE\Microsoft\Windows\CurrentVersion\Explorer\Advanced" /v "TaskbarAnimations" /f

echo.
echo ================================================================================
echo               ГОТОВО! АНИМАЦИЯ ПАНЕЛИ ЗАДАЧ ВКЛЮЧЕНА
echo ================================================================================
echo.
echo Для применения изменений перезапустите Проводник или перезагрузитесь.
echo.

echo.