@echo off
REM Эта команда отключает вывод всех исполняемых команд в окне консоли.
REM Это делает вывод скрипта более чистым и менее загроможденным.
SET REG_KEY="HKCU\Software\Microsoft\Windows\CurrentVersion\Explorer"
REM Мы создаем переменную REG_KEY, которая содержит путь к реестру, 
REM где находится ключ AltTabSettings. HKCU указывает, 
REM что мы работаем с текущим пользователем.
SET VALUE_NAME="AltTabSettings"
REM Мы создаем переменную VALUE_NAME, которая содержит имя значения, 
REM которое будет удалено из указанного пути реестра.
echo Удаляем ключ реестра %REG_KEY%\%VALUE_NAME%
REM Выводим сообщение для пользователя о том, что 
REM ключ реестра будет удален. Это помогает пользователю понять, 
REM что именно происходит.
REG DELETE %REG_KEY% /v %VALUE_NAME% /f
REM Используя команду REG DELETE, мы удаляем указанное 
REM значение из реестра. Параметры:
REM /v указывает имя значения, которое нужно удалить
REM /f означает, что операция будет выполнена без подтверждения. 
REM Это полезно для автоматизации процесса.
IF ERRORLEVEL 1 (
    echo Не удалось удалить ключ реестра %VALUE_NAME%. Убедитесь, что он существует.
) ELSE (
    echo Ключ реестра %VALUE_NAME% успешно удален.
)
REM Проверяем, произошла ли ошибка в предыдущей команде.
REM Если значение ERRORLEVEL равно 1, то команда не выполнена успешно.
REM В зависимости от результата выводим соответствующее сообщение.