@echo off
REM Отключение отображения команд в консоли для более чистого выхода.
REM Устанавливает максимальный срок действия пароля для всех учетных записей в системе на "без ограничения".
REM Это означает, что пароли пользователей не будут истекать и будут действительны бесконечно.
net accounts /maxpwage:unlimited
REM Проверяем, была ли команда выполнена успешно.
IF ERRORLEVEL 1 (
    echo Произошла ошибка при изменении максимального срока действия пароля.
) ELSE (
    echo Максимальный срок действия пароля успешно установлен на "без ограничения".
)
REM Завершение скрипта.