@echo off
REM Отключаем вывод команд в консоли, но оставляем вывод сообщений для пользователя.
echo Шаг 1:
echo Включить sysmain обратно, если отключал
REM Включить sysmain обновите команду по необходимости
REM sc config SysMain start= auto
REM sc start SysMain
echo Шаг 2:
echo Откати твики в HoneCtrl, если использовал
REM Убедитесь, что вы откатили все настройки в HoneCtrl
REM добавьте команду отката, если необходимо
echo Шаг 3:
echo Поставь дефолтный профиль в Nvidia Profile Inspector
REM Убедитесь, что вы загрузили стандартный профиль для вашей видеокарты Nvidia
REM добавьте команду, если необходимо
echo Шаг 4:
echo Отключи MSI mode на видеокарте, если включал вручную, либо измени приоритет с High на Undefined
REM Здесь нужно использовать соответствующую команду для изменения режима MSI и приоритета
echo Шаг 5:
echo Включи HPET, если отключал
REM Включить HPET добавьте нужные команды для включения HPET
echo Шаг 6:
echo Поменяй схему электропитания
REM Установите схему электропитания по умолчанию или другую схему
REM добавьте команду для изменения схемы электропитания
echo Шаг 7:
echo Поменяй Win32PrioritySeparation на другое значение либо вовсе на значение по умолчанию
REM Измените значение Win32PrioritySeparation в реестре
REM Reg.exe add "HKLM\SYSTEM\CurrentControlSet\Control\PriorityControl" /v "Win32PrioritySeparation" /t REG_DWORD /d "другое значение" /f
echo Шаг 8:
echo Отключи и включи снова AntiLag, если использовал; он может забагаться это кстати фикс большинства случаев скачков задержки
REM Отключите и включите AntiLag добавьте нужные команды
echo Шаг 9:
echo Откати оптимизацию DirectX, если использовал
REM Убедитесь, что вы откатили все изменения настройки DirectX
echo Шаг 10:
echo Обновить/переустановить драйвера на видеокарту
REM Убедитесь, что у вас установлены последние версии драйверов видеокарты
REM добавьте команды для обновления, если необходимо
echo.
echo Желательно после каждого шага перезагружать ПК и таким образом выяснить, какой именно твик вам не подошёл, и после этого, соответственно, вернуть те твики, которые вам подошли.
echo Если ничего из этого не помогло:
echo Вариант 1: Откатиться по точке восстановления🖥 
echo Вариант 2: Откатиться по бекапу реестра
echo А так же можно вернуть все службы по умолчанию с помощью reg файлов либо WinCry.
Reborn - Раскрой потенциал своего ПК за бесплатно!
Сервер Discord:
        Reborn PC Optimization
        https://discord.gg/hgBQRsrDRu